In [ ]:
import pandas as pd

In [ ]:
data = [[1,2,3],[4,5,6],[7,8,9]]
data

In [ ]:
list('321')

In [ ]:
df = pd.DataFrame(data, list('321'), list('zyx'))
df

In [ ]:
df.sort_index(inplace=True)
df

In [ ]:
df.sort_index(inplace=True, axis=1)
df

In [ ]:
df.sort_values(by='x', inplace=True)
df

In [ ]:
df.sort_values(by='3', axis = 1, inplace=True)
df

In [ ]:
df.sort_values(by=['x', 'y'], inplace=True)
df

## Simulação Exercícios

In [21]:
data_ex = [[9,6,3],[8,5,2],[7,4,1]]
df_ex = pd.DataFrame(data_ex , list('ZYX'), list('CBA'))
df_ex

   C  B  A
Z  9  6  3
Y  8  5  2
X  7  4  1

In [24]:
df_ex.sort_index()
df_ex.sort_index(axis=1)
df_ex

   C  B  A
Z  9  6  3
Y  8  5  2
X  7  4  1

In [36]:
data_ex = [
    ['Ary', 'M',21],
    ['Cátia', 'F',19],
    ['Carlos', 'M',50],
    ['Beto', 'M',29],
    ['Bruna', 'F',31],
    ['Ana', 'F',42]
]

columns = ['Nome','Sexo','Idade']
index = [str(i) for i in range(len(data_ex))]
df_A = pd.DataFrame(data_ex, columns=columns, index=index)
df_A

     Nome Sexo  Idade
0     Ary    M     21
1   Cátia    F     19
2  Carlos    M     50
3    Beto    M     29
4   Bruna    F     31
5     Ana    F     42

In [40]:
df_B = df_A.sort_values(by = ['Sexo', 'Nome'])
df_B

     Nome Sexo  Idade
5     Ana    F     42
4   Bruna    F     31
1   Cátia    F     19
0     Ary    M     21
3    Beto    M     29
2  Carlos    M     50

In [42]:
df_C = df_A.sort_values(by = ['Nome', 'Sexo'])
df_C

     Nome Sexo  Idade
5     Ana    F     42
0     Ary    M     21
3    Beto    M     29
4   Bruna    F     31
2  Carlos    M     50
1   Cátia    F     19